cases/03_cavityWetting/0.org/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }


    back
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         90;
        limit          gradient;
        value          uniform 0;
    }

    front
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         90;
        limit          gradient;
        value          uniform 0;
    }

    top
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         120;
        limit          gradient;
        value          uniform 0;
    }


    chip
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         90;
        limit          gradient;
        value          uniform 0;
    }

    "array_cavity_bottom_.*"
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         90;
        limit          gradient;
        value          uniform 0;
    }

    symmetryPlane
    {
        type           constantAlphaContactAngle;   //polymer 90, chip 70
        theta0         90;
        limit          gradient;
        value          uniform 0;
    }
}


// ************************************************************************* //
