cases/03_cavityWetting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;
//(-0.0585803 0.0100876 0.023505) (-0.053308 0.0362376 0.026054)
vertices
(
    (-0.1      -0.1    -0.5)
    ( 5.9      -0.1    -0.5)
    ( 5.9       2.9    -0.5)
    (-0.1       2.9    -0.5)
    (-0.1      -0.1     1  )
    ( 5.9      -0.1     1  )
    ( 5.9       2.9     1  )
    (-0.1       2.9     1  )
);

blocks // for 1e-5 cell size: (600 300 150)
(
    hex (0 1 2 3 4 5 6 7) (300 150 75) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    
);

mergePatchPairs
(
);

// ************************************************************************* //

