cases/03_cavityWetting/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
// Include defaults parameters from master dictionary
#includeEtc "caseDicts/meshQualityDict"
//#includeEtc "caseDicts/mesh/generation/meshQualityDict"
 
//- minFaceWeight (0 -> 0.5)
minFaceWeight 0.02;


errorReduction          0.75;

nSmoothScale            4;
// ************************************************************************* //


