cases/03_cavityWetting/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



field           alpha.water;

// calc geom parameters
angleTop_deg		89.9;	// for this method angle must be below 90 deg
angleBot_deg		89.9;
width				0.002;
height				0.00045;

angleTop #calc "$angleTop_deg / 180. * 3.1415927";
angleBot #calc "$angleTop_deg / 180. * 3.1415927";

r 		#calc "$width / (cos($angleTop) + cos($angleBot))";
yCyl  	#calc "$r * cos($angleBot)";
xCyl	#calc "$r + $height";




type            composedFunction;
mode            subtract;
composedFunction
{

     cylinder
     {
        type    cylinder;
		radius	$r;
		origin ($xCyl $yCyl 0.000000e+00); 
		direction (0 0 1);
		scale -1;
     }

     plane
     {
        type    plane;
		origin ($xCyl $yCyl 0.000000e+00); // same as cylinder
		normal (-1 0 0);
     }
}


// ************************************************************************* //
